<?php

namespace App\Core;


class Menu
{
    private static function menu()
    {
        $fake_route = 0;
        return [
            [
                'title' => 'Поток закзов',
                'items' => [
                    [
                        'title' => 'Новые заказы',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Список заказов',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Заказы на консолидацию',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Проблемные заказы',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Возвраты и отмены',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Каталог (товары)',
                'items' => [
                    [
                        'title' => 'Товары',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Справочники свойств',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Товарные свойства',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Категории товаров',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Логистика',
                'items' => [
                    [
                        'title' => 'Статусы доставки',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Таблица соотвествий статусов',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Склады',
                'items' => [
                    [
                        'title' => 'Склад консолидации',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Склад ответсвенного хранения',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Управление контентом',
                'items' => [
                    [
                        'title' => 'Страницы маркетплейса',
                        'route' => '#',
                    ],
                    [
                        'title' => 'SEO',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Маркетинг',
                'items' => [
                    [
                        'title' => 'Брошенные корзины',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Скидки и промокоды',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Подарочные сертификаты',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Бандлы',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Мастер-классы',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Магазин подарков',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Мерчанты',
                'items' => [
                    [
                        'title' => 'Заявки на регистрацию',
                        'route' => route('merchant.registrationList'),
                    ],
                    [
                        'title' => 'Список мерчантов',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Обратная связь с мерчантами',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Взаиморасчёты с мерчантами',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Амбассадоры',
                'items' => [
                    [
                        'title' => 'Заявки на регистрацию',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Список амбассадоров',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Обратная связь с амбассадорами',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Взаиморасчёты с амбассадорами',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Покупатели и профессионалы',
                'items' => [
                    [
                        'title' => 'Список покупателей',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Сегменты покупателей',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Анализ поведения покупателей',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Рассылки',
                'items' => [
                    [
                        'title' => 'Создание рассылки',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Анализ рассылок',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Настройки',
                'items' => [
                    [
                        'title' => 'Профиль',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Пользователи и права',
                        'route' => route('settings.userList'),
                    ],
                    [
                        'title' => 'Настройки интеграций',
                        'route' => '#',
                    ],
                ],
            ],
            [
                'title' => 'Отчёты',
                'items' => [
                    [
                        'title' => 'Стандартные отчёты',
                        'route' => '#',
                    ],
                    [
                        'title' => 'Свободный отчёт',
                        'route' => '#',
                    ],
                ],
            ],
        ];
    }
    
    public static function getMenuItems()
    {
        $menuItems = static::menu();
        
        foreach ($menuItems as &$group) {
            //todo Добавить проверку прав для группы
            foreach ($group['items'] as &$item) {
                //todo Добавить проверку прав для пункта меню
                if (url()->full() == $item['route']) {
                    $item['active'] = true;
                }
            }
        }
        
        return $menuItems;
    }
}